tap "candid82/brew"
tap "homebrew/cask-fonts"
tap "mongodb/brew"
tap "yqrashawn/goku"
brew "zstd"
brew "glib"
brew "chruby"
brew "libnghttp2"
brew "ffmpeg"
brew "fish"
brew "flyctl"
brew "grc"
brew "helix"
brew "icu4c@76"
brew "lima"
brew "nghttp2"
brew "node"
brew "nvm"
brew "pandoc"
brew "powerlevel10k"
brew "pure"
brew "qemu"
brew "ruby"
brew "ruby-install"
brew "ruby@3.1"
brew "typescript"
brew "wget"
brew "yazi"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "yqrashawn/goku/goku"
cask "cursor"
cask "filebot"
cask "font-jetbrains-mono"
cask "font-recursive-code"
cask "ghostty"
cask "iina"
cask "karabiner-elements"
cask "macs-fan-control"
cask "marta"
cask "mtmr"
cask "notion"
cask "notunes"
cask "obsidian"
cask "raycast"
cask "simple-comic"
cask "telegram"
cask "vlc"
cask "zed"
cask "zoom"
vscode "antfu.file-nesting"
vscode "bradlc.vscode-tailwindcss"
vscode "chakra-ui.panda-css-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "k--kato.intellij-idea-keybindings"
vscode "ldd-vs-code.better-package-json"
vscode "orta.vscode-jest"
vscode "shardulm94.trailing-spaces"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
