# Cross-platform CLI tools (Linuxbrew + Homebrew)
# Format: brew "package" # binary_name (if different)

# Taps
tap "oven-sh/bun", trusted: true

# Shell & prompt
brew "zsh"
brew "starship"
brew "grc"          # generic colouriser

# Git tools
brew "git"
brew "gh"
brew "delta"
brew "lazygit"

# Version & package managers
brew "mise"
brew "ni"

# JavaScript runtimes
brew "node"
brew "oven-sh/bun/bun"  # bun

# Search & text processing
brew "ripgrep"      # rg
brew "bat"
brew "jq"

# File management
brew "yazi"
brew "fd"
brew "fzf"
brew "zoxide"
brew "eza"
brew "ouch"

# Terminal multiplexers
brew "tmux"

# AI coding agents & tooling
brew "opencode"
brew "agent-browser"
brew "pi-coding-agent"
brew "herdr"        # agent multiplexer
brew "crit"         # local plan/code review
brew "rtk"          # LLM token-saving CLI proxy

# Dev tools
brew "act"          # run GitHub Actions locally

# Testing
brew "bats-core"    # bats

# System monitoring
brew "btop"
brew "procs"
brew "dust"
brew "duf"

# Yazi dependencies
brew "ffmpeg"
brew "sevenzip"     # 7zz
brew "poppler"
brew "resvg"
brew "imagemagick"
