# macOS-specific packages

# Third-party taps (declare before their formulas; trusted so `brew bundle`
# will install formulas from them on a clean machine)
tap "lazywalker/rgrc", trusted: true
tap "schpet/tap", trusted: true

# CLI tools (macOS only)
brew "elio"         # terminal file manager (theme synced under Library/)
brew "lazywalker/rgrc/rgrc"
brew "terminal-notifier"
brew "schpet/tap/linear"

# AI coding agents (macOS-only casks; cross-platform ones live in Brewfile)
cask "claude-code"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-iosevka-nerd-font"

# Terminal & editors
cask "ghostty"
cask "zed"
cask "vscodium"
cask "webstorm"
cask "obsidian"

# Productivity
cask "raycast"
cask "marta"
cask "ticktick"
cask "setapp"
cask "dropbox"

# Utilities
cask "1password-cli"
cask "karabiner-elements"
cask "the-unarchiver"
cask "imageoptim"

# Media
cask "spotify"
cask "notunes"
cask "iina"
cask "transmission"

# Browsers
cask "helium-browser"
cask "zen"

# Communication
cask "telegram"

# Design
cask "figma"

# Other
cask "android-file-transfer"
